In [54]:
import pandas as pd
import sqlite3

enrollments = pd.read_csv('/kaggle/input/day16-datasets/day_16_enrollments.csv')
students = pd.read_csv('/kaggle/input/day16-datasets/day_16_students.csv')

conn = sqlite3.connect(':memory:')
enrollments.to_sql('enrollments', conn, index=False, if_exists='replace')
students.to_sql('students', conn, index=False, if_exists='replace')

10

In [55]:
pd.read_sql("SELECT * from enrollments LIMIT 5 ; ", conn)

   enrollment_id  student_id           course_name     category   fee month
0            301           1         Python Basics  Programming  1200   Jan
1            302           1      SQL Fundamentals         Data  1000   Feb
2            303           2     Digital Marketing    Marketing  1500   Jan
3            304           2       Content Writing    Marketing   800   Feb
4            305           3  Financial Accounting     Commerce  1100   Mar

In [56]:
pd.read_sql("SELECT * from students LIMIT 5 ; ", conn)

   student_id    name       city course
0           1  Ananya      Delhi    BCA
1           2   Rahul     Mumbai    BSc
2           3    Neha       Pune   BCom
3           4   Karan      Delhi  BTech
4           5  Simran  Bangalore     BA

# Level 1 — Foundations Revision

**Show all students and their cities.**

In [57]:
query = """
SELECT name, city
FROM students
"""

pd.read_sql(query, conn)

     name       city
0  Ananya      Delhi
1   Rahul     Mumbai
2    Neha       Pune
3   Karan      Delhi
4  Simran  Bangalore
5    Amit    Kolkata
6   Priti     Mumbai
7   Rohit    Chennai
8    Isha       Pune
9     Dev  Bangalore

**Show all enrollments where the fee is greater than 1500.**

In [58]:
query = """
SELECT *
FROM enrollments
WHERE fee > 1500 ;
"""

pd.read_sql(query, conn)

   enrollment_id  student_id             course_name     category   fee month
0            306           4         Data Structures  Programming  1800   Jan
1            307           4              Algorithms  Programming  2000   Feb
2            310           7       Business Strategy   Management  1600   Mar
3            311           8  Machine Learning Intro         Data  2200   Mar
4            314          10         Cloud Computing         Tech  2500   Jan
5            315          10           DevOps Basics         Tech  1900   Mar

**Show the names of students who live in Delhi.**

In [59]:
query = """
SELECT name, city
FROM students
WHERE city = 'Delhi' ;
"""

pd.read_sql(query, conn)

     name   city
0  Ananya  Delhi
1   Karan  Delhi

**Show all enrollments for the category "Marketing"**

In [60]:
query = """
SELECT *
FROM enrollments
WHERE category = 'Marketing'
"""

pd.read_sql(query, conn)

   enrollment_id  student_id        course_name   category   fee month
0            303           2  Digital Marketing  Marketing  1500   Jan
1            304           2    Content Writing  Marketing   800   Feb
2            316           2   SEO Fundamentals  Marketing   700   Mar

# Level 2 — Basic JOIN Practice

**Show student name and course_name for all enrollments.**

In [61]:
query = """
SELECT s.name , e.course_name
FROM students s
JOIN enrollments e
ON s.student_id = e.student_id
"""

pd.read_sql(query, conn)

      name             course_name
0   Ananya           Python Basics
1   Ananya        SQL Fundamentals
2    Rahul         Content Writing
3    Rahul       Digital Marketing
4    Rahul        SEO Fundamentals
5     Neha      Excel for Business
6     Neha    Financial Accounting
7    Karan              Algorithms
8    Karan         Data Structures
9   Simran        Creative Writing
10  Simran          Psychology 101
11    Amit              Statistics
12   Priti       Business Strategy
13   Rohit  Machine Learning Intro
14   Rohit           Python Basics
15    Isha              Web Design
16     Dev         Cloud Computing
17     Dev           DevOps Basics

**Show student name, city, and course_name using a JOIN.**

In [62]:
query = """
SELECT s.name, s.city, e.course_name
FROM students s
JOIN enrollments e
ON s.student_id = e.student_id
"""

pd.read_sql(query, conn)

      name       city             course_name
0   Ananya      Delhi           Python Basics
1   Ananya      Delhi        SQL Fundamentals
2    Rahul     Mumbai         Content Writing
3    Rahul     Mumbai       Digital Marketing
4    Rahul     Mumbai        SEO Fundamentals
5     Neha       Pune      Excel for Business
6     Neha       Pune    Financial Accounting
7    Karan      Delhi              Algorithms
8    Karan      Delhi         Data Structures
9   Simran  Bangalore        Creative Writing
10  Simran  Bangalore          Psychology 101
11    Amit    Kolkata              Statistics
12   Priti     Mumbai       Business Strategy
13   Rohit    Chennai  Machine Learning Intro
14   Rohit    Chennai           Python Basics
15    Isha       Pune              Web Design
16     Dev  Bangalore         Cloud Computing
17     Dev  Bangalore           DevOps Basics

**Show students who have enrolled in at least one course.**

In [63]:
query = """
SELECT DISTINCT s.name
FROM students s
JOIN enrollments e
ON s.student_id = e.student_id ;
"""

pd.read_sql(query, conn)

     name
0  Ananya
1   Rahul
2    Neha
3   Karan
4  Simran
5    Amit
6   Priti
7   Rohit
8    Isha
9     Dev

**Show students who have not enrolled in any course.**

In [64]:
query = """
SELECT s.name
FROM students s
LEFT JOIN enrollments e
ON s.student_id = e.student_id
WHERE e.enrollment_id IS NULL ;
"""

pd.read_sql(query, conn)

Empty DataFrame
Columns: [name]
Index: []

# Level 3 — JOIN + GROUP BY

**Show total fee paid by each student.**

In [65]:
query = """
SELECT s.name, SUM(e.fee) as fees_paid
FROM students s
JOIN enrollments e
ON s.student_id = e.student_id
GROUP BY s.name ;
"""

pd.read_sql(query, conn)

     name  fees_paid
0    Amit       1400
1  Ananya       2200
2     Dev       4400
3    Isha       1300
4   Karan       3800
5    Neha       2050
6   Priti       1600
7   Rahul       3000
8   Rohit       3400
9  Simran       1750

**Show total revenue generated from each city.**

In [66]:
query = """
SELECT s.city, SUM(e.fee) AS total_revenue
FROM students s
JOIN enrollments e
ON s.student_id = e.student_id
GROUP BY s.city ; 
"""

pd.read_sql(query, conn)

        city  total_revenue
0  Bangalore           6150
1    Chennai           3400
2      Delhi           6000
3    Kolkata           1400
4     Mumbai           4600
5       Pune           3350

**Show number of enrollments per course category.**

In [67]:
query = """
SELECT s.name, e.category, e.course_name, COUNT(*) as total_enrollments
FROM students s
JOIN enrollments e 
ON s.student_id = e.student_id
GROUP BY e.category ; 
"""

pd.read_sql(query, conn)

     name     category         course_name  total_enrollments
0    Neha     Commerce  Excel for Business                  2
1  Ananya         Data    SQL Fundamentals                  3
2    Isha       Design          Web Design                  1
3  Simran   Humanities    Creative Writing                  2
4   Priti   Management   Business Strategy                  1
5   Rahul    Marketing     Content Writing                  3
6  Ananya  Programming       Python Basics                  4
7     Dev         Tech     Cloud Computing                  2

**Show students who have enrolled in more than one course.**

In [68]:
query = """
SELECT s.name, COUNT(e.enrollment_id) as total_enrollments
FROM students s
JOIN enrollments e 
ON s.student_id = e.student_id
GROUP BY s.name 
HAVING total_enrollments > 1; 
"""

pd.read_sql(query, conn)

     name  total_enrollments
0  Ananya                  2
1     Dev                  2
2   Karan                  2
3    Neha                  2
4   Rahul                  3
5   Rohit                  2
6  Simran                  2

# Level 4 — CASE WHEN

**For each enrollment, show course_name, fee and a label: "Expensive" if fee ≥ 1500 , "Affordable" otherwise**

In [69]:
query = """
SELECT course_name, fee,
       CASE 
           WHEN fee >= 1500 THEN 'Expensive'
           ELSE 'Affordable'
       END AS price_label
FROM enrollments;
"""

pd.read_sql(query, conn)

               course_name   fee price_label
0            Python Basics  1200  Affordable
1         SQL Fundamentals  1000  Affordable
2        Digital Marketing  1500   Expensive
3          Content Writing   800  Affordable
4     Financial Accounting  1100  Affordable
5          Data Structures  1800   Expensive
6               Algorithms  2000   Expensive
7           Psychology 101   900  Affordable
8               Statistics  1400  Affordable
9        Business Strategy  1600   Expensive
10  Machine Learning Intro  2200   Expensive
11           Python Basics  1200  Affordable
12              Web Design  1300  Affordable
13         Cloud Computing  2500   Expensive
14           DevOps Basics  1900   Expensive
15        SEO Fundamentals   700  Affordable
16      Excel for Business   950  Affordable
17        Creative Writing   850  Affordable

**For each student, show name, total_fee and a spending category:
"High Spender" if total_fee ≥ 3000
"Medium Spender" if total_fee between 1500 and 2999
"Low Spender" otherwise**

In [70]:
query = """
SELECT s.name, SUM(e.fee) AS total_fee, 
CASE
    WHEN SUM(e.fee) >= 3000 THEN "High Spender"
    WHEN SUM(e.fee) >= 1500 THEN "Medium Spender"
    ELSE "Low spender"
    END AS spending_category
FROM students s
JOIN enrollments e 
ON s.student_id = e.student_id
GROUP BY s.name ; 
"""

pd.read_sql(query, conn)

     name  total_fee spending_category
0    Amit       1400       Low spender
1  Ananya       2200    Medium Spender
2     Dev       4400      High Spender
3    Isha       1300       Low spender
4   Karan       3800      High Spender
5    Neha       2050    Medium Spender
6   Priti       1600    Medium Spender
7   Rahul       3000      High Spender
8   Rohit       3400      High Spender
9  Simran       1750    Medium Spender

**For each city, show city, total revenue, and label it:
"Strong City" if revenue ≥ 4000
"Developing City" otherwise**

In [71]:
query = """
SELECT s.city, SUM(e.fee) AS total_revenue, CASE
    WHEN SUM(e.fee) >= 4000 THEN "Strong City"
    ELSE "Developing city"
    END AS type_of_city
FROM students s
JOIN enrollments e 
ON s.student_id = e.student_id
GROUP BY s.city ; 
"""

pd.read_sql(query, conn)

        city  total_revenue     type_of_city
0  Bangalore           6150      Strong City
1    Chennai           3400  Developing city
2      Delhi           6000      Strong City
3    Kolkata           1400  Developing city
4     Mumbai           4600      Strong City
5       Pune           3350  Developing city